<?php require 'header.php'; ?>

    <h1>Домашнее задание № 3.</h1>

    <h2>Задание №1 | Вывести числа от 0 до 100, делящиеся на 3.</h2>
    <?php
                                
        $i = 0;
        while ( $i <= 100 ) {
            if ( $i%3 == 0 ){
                echo "$i | ";
			}
            $i++;
        }

    ?>

    <h2>Задание №2 | Do - While, разбить на четные - нечетные.</h2>
    <?php

        $z = 0;
            do {
                if ( $z == 0 )
                    echo "$z - это ноль<br>";
                elseif ( $z > 0 && $z%2 == 0 )
                    echo "$z - четное число<br>";
                else
                    echo "$z - нечетное число<br>";
                $z++;
            } while ( $z <= 10);

    ?>

    <h2>Задание № 3 | Array с областями и горадами</h2>
    <?php

        $cities = array (    "Московская область"   => array("Ногинск", "Кашира", "Долгопрудный", "Дубна", "Щелково"),
                             "Владимирская область" => array("Суздаль", "Ковров", "Гусь-Хрустальный", "Юрьев-Польский", "Муром"),
                             "Иркутская область"    => array("Иркутск", "Братск", "Ангарск", "Черемхово", "Усть-Илимск"),
                             "Астраханская область" => array("Красный Яр", "Астрахань", "Нариманов", "Ахтубинск", "Харабали"),
                             "Краснадарская край"   => array("Анапа", "Краснодар", "Майкоп", "Тихорецк", "Новороссийск"),
                        );
        foreach ($cities as $key => $region)
            echo "<p> $key: <br>".implode(', ', $region)."</p>";

    ?>

    <h2>Задание №4 | Функцию транслитерации строк.</h2>
    <?php

        function rus_to_eng ($text) {

            $alphabet = array (

                "а" => "a",  "б" => "b",  "в"  => "v", "г"  => "g", "д"  => "d",  "е"  => "e",
                "ё" => "yo", "ж" => "zh", "з"  => "z", "и"  => "i", "й"  => "j",  "к"  => "k",
                "л" => "l",  "м" => "m",  "н"  => "n", "о"  => "o", "п"  => "p",  "р"  => "r",
                "с" => "s",  "т" => "t",  "у"  => "u", "ф"  => "f", "х"  => "x",  "ц"  => "c",
                "ч" => "ch", "ш" => "sh", "щ"  => "w", "ь"  => "'", "ы"  => "yh", "ъ"  => "'",
                "э" => "eh", "ю" => "yu", "я"  => "ya",

                "А" => "A",  "Б" => "B",  "В"  => "V", "Г"  => "G", "Д"  => "D",  "Е"  => "E",
                "Ё" => "YO", "Ж" => "ZH", "З"  => "Z", "И"  => "I", "Й"  => "J",  "К"  => "K",
                "Л" => "L",  "М" => "M",  "Н"  => "N", "О"  => "O", "П"  => "P",  "Р"  => "R",
                "С" => "S",  "Т" => "T",  "У"  => "U", "Ф"  => "F", "Х"  => "X",  "Ц"  => "C",
                "Ч" => "CH", "Ш" => "SH", "Щ"  => "W", "Ь"  => "'", "Ы"  => "YH", "Ъ"  => "`",
                "Э" => "EH", "Ю" => "YU", "Я"  => "YA",

            );

            return strtr($text, $alphabet);
        }

        echo rus_to_eng('Транслирую текст, который передал через параметр функции');
    ?>

    <h2>Задание №5 | Функция замены пробелов на подчеркивание.</h2>
    <?php

        function its_to_this ($its, $to_this, $text) {
            return str_replace($its, $to_this, $text);
        }

        echo its_to_this(' ', '_', 'Меняем пробелы на подчеркивание');
    ?>

    <h2>Задание №6 | Вложенное меню сгенерированииое из массива</h2>
    <?php

        $menu = array(  "Компания"              => array("История", "Коллектив", "Мероприятия", "Вакансии"),
                        "Продукция"             => array("Каталог", "Галерея", "Акции", "Новинки"),
                        "Техническая поддержка" => array("Драйвера", "Инструкции","Сервис", "Диагностика"),
						"Контакты"	
					);

        echo "<ul>";
            foreach ($menu as $sup_item => $sub_item) {

                echo "<li>$sup_item</li>";
					if(is_array($sub_item)){
                    echo "<ul>";
                    foreach ($sub_item as $value){
							         echo "<li>$value</li>";
                    }  
                    echo "</ul>";
					}
            }
        echo "</ul>";

    ?>

    <h2>Задание №7 | Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла.</h2>
    <?php
        // Google в помощь
        for ( $x = 0; $x < 10; print $x++ ) {}
        //echo $y;

    ?>

    <h2>Задание №8 | Вывести города из Задания №3, начинающиеся с буквы «К».</h2>
    <?php

    foreach ($cities as $key => $region) {
        echo "<p> $key: <br>";
            for ( $i = 0; $i < count($region); $i ++) {
                if ($region[$i][0]=="К")
                    echo "$region[$i] ";
            }
    }
    
    ?> 

    <h2>Задание №9 | Транслитерация строки и замена пробелов подчеркиванием.</h2>
    <?php

        $article = 'Заметки юного путешественника';

        function beauty_url ($text) {
            return its_to_this(' ', '_', rus_to_eng($text));
        }
		
		
		
		

        echo beauty_url($article);

    ?>