<?php
//$day = 6;//date('w');//4
//if($day > 0 && $day < 6) {
//    echo "Будний день!";
//}
//elseif($day == 0 || $day == 6){
//    echo "Выходной день!";
//}
//else{
//    echo "Некорректный день!";
//}

//$x = 10;
//$check = true;
//if($x >= 10){
//    $x++;
//    if($x < 11){
//        $x *= 2;
//    }
//    if($x<20){
//        $x += 3;
//        if(1){
//            if($check){
//                $x++;//15
//                if("hello world!"){
//                    $x = $x + $x * 2;//45
//                }
//            }
//            if("sfsdf"){
//                $x += 2;
//            }
//        }
//    }
//    else{
//        if("test"){
//            $x = 99;
//        }
//    }
//}
//echo ++$x;

//Альтернативный синтаксис операторо в PHP
$day = date('w');
if($day > 0 && $day < 6) :?>
    <h1>День №<?= $day?> - будний день</h1>
<?php
else:?>
    <h1>День №<?= $day?> - выходной день</h1>
<?php
    endif;
?>